
Функция ИдентификационныйЗапросPOST(Запрос)
	
//"<?xml version=""1.0"" encoding=""windows -1251""?>
//|<request command=""check"">
//|<version>1.6</version>
//|<doc>
//|<request>
//|<req_id>142474875546888</req_id>
//|<req_time>20150224063241</req_time>
//|</request>
//|<payment>
//|<pay_amount>10000</pay_amount>
//|</payment>
//|<recipient>
//|<rec_acc>123456789</rec_acc>
//|<rec_fio>АЛЬФАНОВА РАИСА ДМИТРИЕВНА</rec_fio>
//|</recipient>
//|</doc>
//|</request>"
//	

//<?xml version="1.0" encoding="windows -1251"?><response command="check"><version>1.6</version><doc><request><req_id>142474875546888</req_id><req_time>20150224063241</req_time></request><result>0</result><comment>1</comment><extra><field1/><field2/><field3/></extra></doc></response> 


//Функция ШаблонGetInfo(Запрос)
// тОтвет = "HTTPМетод - "+Запрос.HTTPМетод+"
//";
// тОтвет = тОтвет+"БазовыйURL - "+Запрос.БазовыйURL+"
//";
// тОтвет = тОтвет+"ОтносительныйURL - "+Запрос.ОтносительныйURL+"
//";
// 
// Для Каждого тЭлем Из Запрос.ПараметрыURL Цикл
// тОтвет = тОтвет+"
//"+"ПараметрыURL["+тЭлем.Ключ+"]"+" - "+тЭлем.Значение;
// КонецЦикла;
// 
// тОтвет = тОтвет + "
//";
// Для Каждого тЭлем Из Запрос.ПараметрыЗапроса Цикл
// тОтвет = тОтвет+"
//"+"ПараметрыЗапроса["+тЭлем.Ключ+"]"+" - "+тЭлем.Значение;
// КонецЦикла; 
// 
// тОтвет = тОтвет + "
//";
// Для Каждого тЭлем Из Запрос.Заголовки Цикл
// тОтвет = тОтвет+"
//"+"Заголовки["+тЭлем.Ключ+"]"+" - "+тЭлем.Значение;
// КонецЦикла; 




//Код Комментарий Фатальность Описание
//0 ОК Идентификационный запрос:
//- проверка Партнера прошла успешно, такой 
//идентификационный номер КЛИЕНТА есть, 
//4927558002;24.02.2015;06.37.55;40817810200955002061;АЛЬФАНОВА РАИСА 
//ДМИТРИЕВНА;100.00
//4927558003;24.02.2015;06.40.32;40817810200955002088;СЕМЕНОВ СЕРГЕЙ 
//ПЕТРОВИЧ;500.80
//4927558004;24.02.2015;06.57.18;40817810200955002024;ИВАНОВ ЮРИЙ 
//НИКОЛАЕВИЧ;16000.00
//Total: 3; 16600.80
//Отдел разработки Онлайн-сервисов, Дирекция Денежных Переводов, 
//Центр Финансовых Технологий
//9
//Конфиденциально
//идентификационный номер КЛИЕНТА можно пополнять, он 
//не в архиве, он не закрыт, он принадлежит этому КЛИЕНТУ 
//и т.д.
//Уведомление о принятом ПЕРЕВОДЕ:
//- ПЕРЕВОД зачислен.
//1 Временная ошибка. 
//Повторите запрос 
//позже
//Временная недоступность шлюза, например технические 
//неполадки.
//1001 Неверный формат 
//идентификатора 
//КЛИЕНТА
//+ Идентификатор КЛИЕНТА не проходит проверку формата 
//на стороне Партнера:
//- идентификационный номер КЛИЕНТА введен не 
//полностью; 
//- маска не соответствует тому, что Партнер заявил в 
//договоре.
//1002 Идентификатор 
//КЛИЕНТА не найден 
//(Ошиблись 
//номером) 
//+ Нет такого идентификационного номера КЛИЕНТА
//1003 Прием ПЕРЕВОДА 
//запрещен 
//Партнером
//+ Партнер по той или иной причине не может принять 
//ПЕРЕВОД
//1004 Прием ПЕРЕВОДА 
//запрещен по 
//техническим 
//причинам 
//+ Партнер не может принять ПЕРЕВОД по техническим 
//причинам. Например, сбой на сервере.
//1005 Неверное ФИО 
//КЛИЕНТА
//+ ФИО КЛИЕНТА не проходит проверку формата на стороне 
//Партнера:
//- ФИО введено не полностью
//- ФИО введено не верно
//- ФИО не соответствует идентификационному номеру 
//КЛИЕНТА
//1006 Договор КЛИЕНТА 
//не активен
//+ Идентификационный номер КЛИЕНТА в архиве или закрыт.
//1007 Сумма слишком 
//мала 
//+ Данную ошибку необходимо возвращать, если на стороне 
//Партнера есть ограничения по минимальной сумме 
//зачисления. При этом сумма платежного поручения клиента 
//меньше установленной минимальной суммы.
//Это актуально, если Партнер умеет контролировать сумму 
//по графику.
//1008 Сумма слишком 
//велика 
//+ Данную ошибку необходимо возвращать, если на стороне 
//Партнера есть ограничения по максимальной сумме 
//зачисления. При этом сумма платежного поручения клиента 
//больше установленной максимальной суммы. 
//Это актуально, если Партнер умеет контролировать сумму 
//по графику.
//1009 Невозможно 
//проверить состояние 
//договора
//+ Невозможно проверить, является ли действующим 
//идентификационный номер КЛИЕНТА и не находится ли он в 
//архиве на текущий момент.
//Отдел разработки Онлайн-сервисов, Дирекция Денежных Переводов, 
//Центр Финансовых Технологий
//10
//Конфиденциально
//1010 Другая ошибка 
//Партнера
//+ Произошла ошибка, из-за которой не могут быть зачислены 
//денежные средства, но она не попадает не под один из 
//перечисленных случаев

	Файл = Новый ЧтениеXML;
	Файл.УстановитьСтроку("<?xml version=""1.0"" encoding=""windows-1251""?>
	|<request command=""check"">
	|<version>1.6</version>
	|<doc>
	|<request>
	|<req_id>142474875546888</req_id>
	|<req_time>20150224063241</req_time>
	|</request>
	|<payment>
	|<pay_amount>10000</pay_amount>
	|</payment>
	|<recipient>
	|<rec_acc>123456789</rec_acc>
	|<rec_fio>АЛЬФАНОВА РАИСА ДМИТРИЕВНА</rec_fio>
	|</recipient>
	|</doc>
	|</request>");
		
    ПараметрыЗапроса = Новый Структура;
	Атрибуты = Новый Структура;
	ТекРеквизит = "";
	Пока Файл.Прочитать() Цикл
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		 ТекРеквизит = Файл.Имя;
         Пока Файл.ПрочитатьАтрибут() Цикл
    		Атрибуты.Вставить(Файл.Имя,Файл.Значение);
		КонецЦикла;   
		КонецЕсли;    
		Если Файл.ТипУзла = ТипУзлаXML.Текст Тогда
			ПараметрыЗапроса.Вставить(ТекРеквизит,Файл.Значение);
		КонецЕсли;    
		Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			//
		КонецЕсли;    
	КонецЦикла;   
	Файл.Закрыть();
	
	
	
	
	
	
	
тОтвет="<?xml version="1.0" encoding=""windows-1251""?>
|<response command="+Команда+">
|<version>"+Команда+"</version>
|<doc>
|<request>
|<req_id>142474875546888</req_id>
|<req_time>20150224063241</req_time>
|</request>
|<result>0</result>
|<comment>1</comment>
|<extra>
|<field1/>
|<field2/>
|<field3/>
|</extra>
|</doc>
|</response>";
	



 HTTPОтвет = Новый HTTPСервисОтвет(200);
 HTTPОтвет.УстановитьТелоИзСтроки(тОтвет);
 HTTPОтвет.Заголовки["Content-Type"] = "text/xml; charset=windows-1251"; //сообщаем что это html
 
 Возврат HTTPОтвет;
КонецФункции

ВыполнитьПроверку(Ндог,ФИО)

//	Ответ = Новый HTTPСервисОтвет(200);
//	Возврат Ответ;
//КонецФункции
