
////////////////////////////////////////////////////////////////////////////////
//
// Функция СтруктураПараметровИзЗапроса
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
//Файл = Новый ЧтениеXML;
//Файл.УстановитьСтроку(Запрос);
//ПараметрыЗапроса = Новый Структура;
//Атрибуты = Новый Структура;
//ТекРеквизит = "";
//Пока Файл.Прочитать() Цикл
//	Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
//	 ТекРеквизит = Файл.Имя;
//     Пока Файл.ПрочитатьАтрибут() Цикл
//		Атрибуты.Вставить(Файл.Имя,Файл.Значение);
//	КонецЦикла;   
//	КонецЕсли;    
//	Если Файл.ТипУзла = ТипУзлаXML.Текст Тогда
//		ПараметрыЗапроса.Вставить(ТекРеквизит,Файл.Значение);
//	КонецЕсли;    
//	Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
//		//
//	КонецЕсли;    
//КонецЦикла;   
//Файл.Закрыть();
Функция СтруктураПараметровИзЗапроса(Запрос)
	Файл = Новый ЧтениеXML;
	Файл.УстановитьСтроку(Запрос);
	ПараметрыЗапроса = Новый Структура;
	ТекРеквизит = "";
	Пока Файл.Прочитать() Цикл
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ТекРеквизит = Файл.Имя;
			Пока Файл.ПрочитатьАтрибут() Цикл
			КонецЦикла;   
		КонецЕсли;    
		Если Файл.ТипУзла = ТипУзлаXML.Текст Тогда
			ПараметрыЗапроса.Вставить(ТекРеквизит,Файл.Значение);
		КонецЕсли;    
		Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		КонецЕсли;    
	КонецЦикла;   
	Файл.Закрыть();
	Возврат ПараметрыЗапроса;
КонецФункции //СтруктураПараметровИзЗапроса

////////////////////////////////////////////////////////////////////////////////
//
// Функция СтруктураАтрибутовИзЗапроса
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция СтруктураАтрибутовИзЗапроса(Запрос)
	Файл = Новый ЧтениеXML;
	Файл.УстановитьСтроку(Запрос);
	Атрибуты = Новый Структура;
	Пока Файл.Прочитать() Цикл
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			ТекРеквизит = Файл.Имя;
			Пока Файл.ПрочитатьАтрибут() Цикл
				Атрибуты.Вставить(Файл.Имя,Файл.Значение);
			КонецЦикла;   
		КонецЕсли;    
		Если Файл.ТипУзла = ТипУзлаXML.Текст Тогда
		КонецЕсли;    
		Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
		КонецЕсли;    
	КонецЦикла;   
	Файл.Закрыть();
	Возврат Атрибуты;
КонецФункции //СтруктураАтрибутовИзЗапроса

////////////////////////////////////////////////////////////////////////////////
//
// Функция СформироватьОтвет
//
// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция СформироватьОтвет(СтруктураОтвета)
	Ответ="<?xml version=""1.0"" encoding=""windows-1251""?>
	|<response command="+СтруктураОтвета.Команда+">
	|<version>"+СтруктураОтвета.Версия+"</version>
	|<doc>
	|<request>
	|<req_id>"+СтруктураОтвета.req_id+"</req_id>
	|<req_time>"+СтруктураОтвета.req_time+"</req_time>
	|</request>
	|<result>"+СтруктураОтвета.result+"</result>
	|<comment>"+СтруктураОтвета.comment+"</comment>
	//|<extra>
	//|<field1/>
	//|<field2/>
	//|<field3/>
	//|</extra>
	|</doc>
	|</response>";
	Возврат Ответ;	
КонецФункции //СформироватьОтвет
